var gyoshu = {
    index: function(label){
        var result = 0;
        $.each(this.data(), function(i, val){
            if (val === label){
                result = i;
                return false;
            }
        });
        return result;
    },
    data: function(){
        return [
            "水産・農林業",
            "鉱業",
            "建設業",
            "食料品",
            "繊維製品",
            "パルプ・紙",
            "化学",
            "医薬品",
            "石油・石炭製品",
            "ゴム製品",
            "ガラス・土石製品",
            "鉄鋼",
            "非鉄金属",
            "金属製品",
            "機械",
            "電気機器",
            "輸送用機器",
            "精密機器",
            "その他製品",
            "電気・ガス業",
            "陸運業",
            "海運業",
            "空運業",
            "倉庫・運輸関連業",
            "情報・通信",
            "卸売業",
            "小売業",
            "銀行業",
            "証券業",
            "保険業",
            "その他金融業",
            "不動産業",
            "サービス業"
        ];
    },
    category: function(){
        return [
            ["景気敏感", [1,4,5,6,11,12,13,14,15,16,17,21,22,25]],
            ["ディフェンシブ", [3,7,8,9,10,19,24]],
            ["中間", [0,2,18,20,23,26,27,28,29,30,31,32]]
        ];
    }
};